<!DOCTYPE html>
<html lang="ru">

<head>
    <link rel="stylesheet" href="/my_site/css/style.css" />
    <link rel="stylesheet" type="text/css" href="css/styleForUS.css">
</head>

<body>
    <div class="col-lg-12">
        <p>Наша парикхмахерская MONEBOR лучшая в городе, АТВЕЧАЮ БРАТ! Рекомендую вам сделать стрижку тут, или бороду подровнять. За качество атвечаю! Что касается цен - они себя стоят!!! Стригут только профессианалы, мы им платим много много денег чтобы они делали свою работу очень хорошо. А если у человека есть деньги, ему не нужны никакие парикмахерские услуги, он и сам может себе что-то сделать, ведь люди же не все могут сделать себе стрижку, но некоторые могут. Люди, не верьте глупым слухам, что в парикмахерских цены заоблачные, это не правда, цены самые обычные. Я сам хожу к ним уже 5 лет, и не жалуюсь, вот на днях стригся, мне все сделали на высшем уровне, хотя мой мастер не была на работе уже 2,5 недели, у неё был отпуск. Вы тоже можете придти в любое время и вам сделают все, что вы захотите. А еще у них есть услуга: "муж на час", вы можете придти и попросить его подстричь вас. На всякий случай мы записали номера телефонов парикмахера и мастера маникюра (все это делает мой муж), вот вам номера: 8-960-558-00-15 Мастер маникюра 8-920-670-35-33 Парикмахер - 8-985-339-78-40. Вот номера, по которым вы сможете с ними связаться, это на всякий случай, вдруг вам надо будет срочно постричься, а времени куда-то идти нет.</p>
    </div>

    <div class="col-lg-12">
        <ul class="nav justify-content-center">
            <li class="nav-item">
                <a class="nav-link" aria-current="page" href="https://vk.com/danil_from_durka"><img src="img/vk.png"></a>
            </li>
            <li class="nav-item">
                <a class="nav-link" href="https://www.instagram.com/danilkhromenko/?hl=ru"><img src="img/inst.png"></a>
            </li>
            <li class="nav-item">
                <a class="nav-link" href="tel:89785145650"><h1>По всем вопросам:</br>+7 978 514-56-50</h1></a>
            </li>
        </ul>
    </div>
</body>